<?xml version="1.0" encoding="utf-8"?>
<rss xmlns:atom="http://www.w3.org/2005/Atom" version="2.0"><channel><title>www.eduherraiz.com - Entradas de la categoría Sin categoría</title><link>http://www.eduherraiz.com/blog/categories/sin-categoria/</link><description>Las últimas entradas de la categoría Sin categoría</description><atom:link href="http://www.eduherraiz.com/blog/feeds/categories/sin-categoria/" rel="self"></atom:link><language>es</language><copyright>Zinnia</copyright><lastBuildDate>Thu, 04 Oct 2012 08:37:24 +0000</lastBuildDate><item><title>Desactivar el altavoz (pc speaker) en linux
</title><link>http://www.eduherraiz.com/blog/2012/10/04/desactivar-el-altavoz-pc-speaker-en-linux/</link><description>&lt;p&gt;Crea un script en  /etc/profile.d/matar_altavoz.sh con el siguiente contenido:&lt;br /&gt;&lt;blockquote&gt;setterm -blength 0&lt;br /&gt;set bell-style none&lt;br /&gt;amixer set 'PC Speaker' 0% mute&lt;br /&gt;amixer set 'PC Beep' 0% mute&lt;br /&gt;amixer set 'Beep' 0% mute&lt;/blockquote&gt;&lt;br /&gt;Dale permisos de ejecución:&lt;br /&gt;&lt;blockquote&gt;chmod +x /etc/profile.d/matar_altavoz.sh&lt;/blockquote&gt;&lt;br /&gt;Y ejecútalo:&lt;br /&gt;&lt;blockquote&gt;/etc/profile.d/matar_altavoz.sh&lt;/blockquote&gt;&lt;/p&gt;
</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Thu, 04 Oct 2012 08:37:24 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2012/10/04/desactivar-el-altavoz-pc-speaker-en-linux/</guid><category>Sin categoría</category></item><item><title>Script para sincronizar carpeta remota vía rsync
</title><link>http://www.eduherraiz.com/blog/2011/06/28/script-para-sincronizar-carpeta-remota-via-rsync/</link><description>&lt;p&gt;Ayer me propuse&amp;nbsp; sincronizar la carpeta de series del servidor de disco con el disco de m&amp;iacute; nuevo &lt;a href="http://en.wikipedia.org/wiki/Home_theater_PC"&gt;HTPC&lt;/a&gt;. Pens&amp;eacute; que era necesario hacer algo para que esteń siempre sincronizadas los dos directorios, as&amp;iacute; cuando descargue nuevos cap&amp;iacute;tulos no tendr&amp;eacute; que actualizarlo a mano. Busqu&amp;eacute; alguna soluci&amp;oacute;n entre las aplicaciones que hacen backups, pero no encontr&amp;eacute; algo sencillo y me decid&amp;iacute; a hacer un script cutre en bash utilizando el cl&amp;aacute;sico rsync para sincronizar. Problemas que resuelve el script:&lt;/p&gt;

&lt;ul&gt;
	&lt;li&gt;Comprueba que el script no haya sido lanzado ya.&lt;/li&gt;
	&lt;li&gt;Comprueba que el HTPC est&amp;eacute; encendido, haciendo ping.&lt;/li&gt;
	&lt;li&gt;Espera un tiempo prudencial 60 segundos, por si el HTPC acaba de encenderse y as&amp;iacute; dar tiempo a arrancar el sistema.&lt;/li&gt;
	&lt;li&gt;Lanza el rsync para sincronizar las dos carpetas remotas. En este caso el script se inicia en el servidor de disco, pero solo habr&amp;iacute;a que modificar el comando rsync si queremos hacerlo desde el otro lado.&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;Dependencias:&lt;/p&gt;

&lt;ul&gt;
	&lt;li&gt;Tener instalado el comando fping:&lt;/li&gt;
&lt;/ul&gt;

&lt;blockquote&gt;aptitude install fping&lt;/blockquote&gt;

&lt;ul&gt;
	&lt;li&gt;Permitir el login sin password del servidor de disco al HTPC, pod&amp;eacute;is seguir este manual que me funcion&amp;oacute; a m&amp;iacute;:&lt;/li&gt;
&lt;/ul&gt;

&lt;blockquote&gt;&lt;a href="http://libtronics.com/2011/06/ssh-login-without-password/"&gt;http://libtronics.com/2011/06/ssh-login-without-password/&lt;/a&gt;&lt;/blockquote&gt;

&lt;p&gt;Y este es el script:&lt;/p&gt;

&lt;pre class="brush:php"&gt;
#!/bin/bash
FILE=/tmp/mirroring-xbmc

if [ -e $FILE ]
then
                exit # THe program is running
else
        touch $FILE
        status=`fping 192.168.1.20 | cut -d &amp;#39; &amp;#39; -f 3`
        if [ $status == &amp;quot;alive&amp;quot; ]
        then
                sleep 60
                rsync -azC --force --delete --progress -e &amp;quot;ssh -p22&amp;quot; /mnt/xuflus/Series/ xbmc@192.168.1.20:/home/xbmc/Series/
        fi
        rm $FILE
fi&lt;/pre&gt;

&lt;p&gt;Guardamos el script en /usr/bin/mirroring-xbmc, le damos permisos de ejecuci&amp;oacute;n:&lt;/p&gt;

&lt;blockquote&gt;chmod +x /usr/bin/mirroring-xbmc&lt;/blockquote&gt;

&lt;p&gt;Ya solo queda incluirlo en el crontab para que se ejecute cada cierto tiempo:&lt;/p&gt;

&lt;blockquote&gt;crontab -e&lt;/blockquote&gt;

&lt;p&gt;Y a&amp;ntilde;adir esta linea (se ejecutar&amp;aacute; cada diez minutos):&lt;/p&gt;

&lt;blockquote&gt;*/10 * * * * mirroring-xbmc&lt;/blockquote&gt;

&lt;p&gt;Seguro que es reinventar la rueda, y creo que se deber&amp;iacute;a hacer como un daemon de ubuntu, con la estructura correcta en /etc/init.d . Pero como para m&amp;iacute; es funcional lo voy a dejar as&amp;iacute;.&lt;/p&gt;

</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Tue, 28 Jun 2011 11:17:18 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2011/06/28/script-para-sincronizar-carpeta-remota-via-rsync/</guid><category>Sin categoría</category></item><item><title>El fin de las playas de Mallorca
</title><link>http://www.eduherraiz.com/blog/2011/06/04/el-fin-de-las-playas-de-mallorca/</link><description>&lt;p&gt;Llevo un par de semanas d&amp;aacute;ndole vueltas a como explicar un problema que veo en las playas de Mallorca y finalmente lo he hecho en un&amp;nbsp; v&amp;iacute;deo para que resulte m&amp;aacute;s digerible. Aqu&amp;iacute; lo pod&amp;eacute;is ver:&lt;/p&gt;

&lt;p&gt;&lt;iframe allowfullscreen="" frameborder="0" height="315" src="//www.youtube.com/embed/JMJPWSHK2hg" width="560"&gt;&lt;/iframe&gt;&lt;/p&gt;

&lt;p&gt;Os dejo la transcripci&amp;oacute;n del v&amp;iacute;deo a continuaci&amp;oacute;n:&lt;/p&gt;

&lt;p&gt;Me encuentro situado en el mayor arenal del sur de Mallorca: la playa de Es Trenc. Como pod&amp;eacute;is ver, toda la orilla se encuentra a rebosar de alga posidonea, que los temporales han arrancado y acumulado. No muy lejos de donde me encuentro ahora, pude escuchar a una mujer que paseaba por la playa, decir algo que me anim&amp;oacute; a grabar esto. Ella sosten&amp;iacute;a que una playa es como una naranja o un melocot&amp;oacute;n, que para poder com&amp;eacute;rtela tienes que pelarla, es decir, quitarle el alga. De primeras, puede parecer que el alga muerta no representa m&amp;aacute;s que un deshecho y que podemos retirarla como hacemos desde muchos a&amp;ntilde;os. Retirar el alga tiene dos grand&amp;iacute;simos inconvenientes: Primero, es imposible quitar el alga sin llevarse la arena. El m&amp;eacute;todo que utilizamos para quitarla es el de un tractor con una pala que la recoge acumul&amp;aacute;ndola en montones para que un cami&amp;oacute;n se lleva despu&amp;eacute;s. Que se lleve arena produce que cada a&amp;ntilde;o la playa retroceda y quede menos arena donde poner las toallas. &amp;iquest;Cuanto tiempo pasar&amp;aacute; hasta que no quede arena y pidan regenerar la playa desgraci&amp;aacute;ndola de por vida? Este tema preocupa a los pol&amp;iacute;ticos mallorquines, no hay m&amp;aacute;s que ver estas esterillas que colocaron dos a&amp;ntilde;os atr&amp;aacute;s, por toda la playa, para que el viento no se lleve la arena, hoy destrozadas completamente y con un gasto inmenso que pagamos todos, sin que diese ning&amp;uacute;n resultado, pues las playas siguen retrocediendo. El segundo inconveniente es el da&amp;ntilde;o que se hace al ecosistema. En el alga muerta viven, se refugian y se alimentan multitud de especies de crust&amp;aacute;ceos, insectos, anf&amp;iacute;podos e is&amp;oacute;podos. De estos peque&amp;ntilde;os animales se alimentan peces peque&amp;ntilde;os como los mabres, que a su vez son parte importante de la dieta de depredadores como lubinas, palometas o serviolas. Todo se ve afectado. Yo, que soy pescador, corroboro con un 70% menos de capturas una vez que quitan el alga. En sentido metaf&amp;oacute;rico yo lo veo como si para que los turistas puedan disfrutar de un bosque de pinos tuvi&amp;eacute;ramos que arrancar cada a&amp;ntilde;o todo el bosque bajo que da cobijo y protege a multitud de animales que sostienen el bosque. &amp;iquest;Cuanto iba a durar el bosque? &amp;iquest;Cuanto va a durar la playa?&lt;/p&gt;

&lt;p&gt;&lt;a href="http://es.wikipedia.org/wiki/Posidonia_oceanica"&gt;M&amp;aacute;s informaci&amp;oacute;n sobre el alga posidonea en la wikipedia&lt;/a&gt;&lt;/p&gt;

</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Sat, 04 Jun 2011 20:55:31 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2011/06/04/el-fin-de-las-playas-de-mallorca/</guid><category>Sin categoría</category></item><item><title>Quad-copter de Biel
</title><link>http://www.eduherraiz.com/blog/2011/02/19/quad-copter-de-biel/</link><description>&lt;p&gt;Esta semana me acerqu&amp;eacute; a casa de Biel para que al fin me ense&amp;ntilde;ase su &amp;uacute;ltimo proyecto: un &lt;strong&gt;Quad-copter&lt;/strong&gt;. Consiste en un peque&amp;ntilde;o aparato volador con cuatro h&amp;eacute;lices gestionadas por una peque&amp;ntilde;a placa &lt;a href="http://es.wikipedia.org/wiki/Arduino"&gt;Arduino&lt;/a&gt; y controlado todo por un mando de radio-frecuencia. Como pod&amp;eacute;is ver en el siguiente v&amp;iacute;deo ya est&amp;aacute; volando:&lt;/p&gt;

&lt;p&gt;&lt;iframe allowfullscreen="" frameborder="0" height="300" mozallowfullscreen="" src="//player.vimeo.com/video/20099487" webkitallowfullscreen="" width="500"&gt;&lt;/iframe&gt;&lt;/p&gt;

&lt;p&gt;&lt;a href="http://vimeo.com/20099487"&gt;Quad-copter de Biel&lt;/a&gt; from &lt;a href="http://vimeo.com/user3336866"&gt;Edu Herraiz&lt;/a&gt; on &lt;a href="https://vimeo.com"&gt;Vimeo&lt;/a&gt;.&lt;/p&gt;

&lt;p&gt;Biel no es el &amp;uacute;nico y esto de los helic&amp;oacute;pteros est&amp;aacute; muy de moda, hay quien les a&amp;ntilde;ade &lt;a href="http://www.mikrokopter.de/ucwiki/en/MikroKopter?action=show&amp;amp;redirect=FrontPage"&gt;funcionalidad por GPS&lt;/a&gt; o un sistema de c&amp;aacute;mara de v&amp;iacute;deo para ver por donde vuela sin perder la referencia en el mando que lo pilota.&lt;!-- The Embed code for Quad-copter de Biel Ends here--&gt;&lt;/p&gt;

&lt;p&gt;&lt;iframe allowfullscreen="" frameborder="0" height="375" mozallowfullscreen="" src="//player.vimeo.com/video/6194911" webkitallowfullscreen="" width="500"&gt;&lt;/iframe&gt;&lt;/p&gt;

&lt;p&gt;&lt;a href="http://vimeo.com/6194911"&gt;MikroKopter - HexaKopter&lt;/a&gt; from &lt;a href="http://vimeo.com/user958157"&gt;Holger Buss&lt;/a&gt; on &lt;a href="https://vimeo.com"&gt;Vimeo&lt;/a&gt;.&lt;/p&gt;

</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Sat, 19 Feb 2011 13:23:58 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2011/02/19/quad-copter-de-biel/</guid><category>Sin categoría</category></item></channel></rss>