<?xml version="1.0" encoding="utf-8"?>
<rss xmlns:atom="http://www.w3.org/2005/Atom" version="2.0"><channel><title>www.eduherraiz.com - Entradas de la categoría Anime</title><link>http://www.eduherraiz.com/blog/categories/anime/</link><description>Las últimas entradas de la categoría Anime</description><atom:link href="http://www.eduherraiz.com/blog/feeds/categories/anime/" rel="self"></atom:link><language>es</language><copyright>Zinnia</copyright><lastBuildDate>Fri, 28 Oct 2011 16:59:52 +0000</lastBuildDate><item><title>Beck o Mongolian chop squad
</title><link>http://www.eduherraiz.com/blog/2011/10/28/beck-o-mongolian-chop-squad/</link><description>&lt;p&gt;Soy aficionado al mundo de la animaci&amp;oacute;n japonesa, el anime, un buen vicio que adquir&amp;iacute; hace 7 a&amp;ntilde;os y arrastro hasta la fecha con m&amp;aacute;s o menos seguimiento de series.&lt;/p&gt;

&lt;p&gt;Empec&amp;eacute; con el archi-conocido &lt;a href="http://es.wikipedia.org/wiki/Naruto"&gt;Naruto&lt;/a&gt;, pero pronto diversifiqu&amp;eacute; a otros g&amp;eacute;neros y estilos. No os voy a escribir de las m&amp;aacute;s conocidas, pero si que me gustar&amp;iacute;a hacerlo de las que no lo son tanto. Una de mis series favoritas de entre las que he podido ver es&amp;nbsp; una que consta de una sola temporada de 26 cap&amp;iacute;tulos, trata el tema de la m&amp;uacute;sica y recibe al nombre de &amp;quot;Beck&amp;quot;.&lt;/p&gt;

&lt;p&gt;La serie va contando como un adolescente japon&amp;eacute;s se va introduciendo en la m&amp;uacute;sica, aprendiendo a tocar y a vivir al mismo tiempo, con una pasi&amp;oacute;n y genialidad ocultas tras un chico t&amp;iacute;mido y miedoso. Con mucha humildad es admitido en un grupo de rock que intenta despegar hac&amp;iacute;a la fama, pero seg&amp;uacute;n va transcurriendo la historia se convierte en el alma&amp;nbsp; del grupo y por muchos problemas que aparezcan todo se une gracias a &amp;eacute;l. Puedes pensar que el tema musical no te convence, pero te recomiendo que le des una oportunidad pues une un poco de todo: acci&amp;oacute;n, humor, drama y romanticismo.&lt;/p&gt;

&lt;p&gt;Una historia total de esas que puedes volver a visionar y no te cansas. Como no pod&amp;iacute;a ser de otra manera la banda sonora es espectacular y tiene regustos cl&amp;aacute;sicos, incluso versionando a los Beatles y su &amp;quot;I&amp;#39;ve got a feeling&amp;quot;. Precisamente os dejo con esa peque&amp;ntilde;a muestra de la serie, un v&amp;iacute;deo musical con la versi&amp;oacute;n y tambi&amp;eacute;n la original para que pod&amp;aacute;is comparar. No dud&amp;eacute;is en contactar si ten&amp;eacute;is problemas para encontrar la serie, pues la tengo completa con los subt&amp;iacute;tulos en castellano. Y si quer&amp;eacute;is saber m&amp;aacute;s de la serie, &lt;a href="http://es.wikipedia.org/wiki/Beck_%28manga%29"&gt;la wikipedia&lt;/a&gt; est&amp;aacute; muy acertada como siempre.&lt;/p&gt;

&lt;p&gt;Versi&amp;oacute;n de Beck:&lt;/p&gt;

&lt;p&gt;&lt;iframe allowfullscreen="" frameborder="0" height="315" src="//www.youtube.com/embed/iaV8YIY5vg8" width="420"&gt;&lt;/iframe&gt;&lt;/p&gt;

</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Fri, 28 Oct 2011 16:59:52 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2011/10/28/beck-o-mongolian-chop-squad/</guid><category>Anime</category></item></channel></rss>