<?xml version="1.0" encoding="utf-8"?>
<rss xmlns:atom="http://www.w3.org/2005/Atom" version="2.0"><channel><title>www.eduherraiz.com - Entradas de la categoría Web</title><link>http://www.eduherraiz.com/blog/categories/web/</link><description>Las últimas entradas de la categoría Web</description><atom:link href="http://www.eduherraiz.com/blog/feeds/categories/web/" rel="self"></atom:link><language>es</language><copyright>Zinnia</copyright><lastBuildDate>Sat, 14 Mar 2015 21:56:40 +0000</lastBuildDate><item><title>¿Porqué es tan caro hacer una página web?
</title><link>http://www.eduherraiz.com/blog/2015/03/14/porque-es-tan-caro-hacer-una-pagina-web/</link><description>&lt;p&gt;&lt;span style="line-height: 20.7999992370605px;"&gt;Ultimamente m&lt;/span&gt;e he encontrado varias ocasiones&amp;nbsp;donde se pone en duda el &lt;strong&gt;alto coste&lt;/strong&gt; que tiene hacer una &lt;strong&gt;p&amp;aacute;gina web&lt;/strong&gt; o donde se busca a una persona &amp;uacute;nica que la haga, como si eso fuese a salir m&amp;aacute;s barato.&amp;nbsp;&lt;br /&gt;
Como creo que es porque se desconoce todo lo que se necesita para llevar a cabo un proyecto voy a intentar introducir el proceso sin entrar en tecnicismos.&lt;/p&gt;

&lt;p&gt;Para empezar, alguien tiene que entender &lt;strong&gt;que es lo que quieres&lt;/strong&gt;, que &lt;strong&gt;tecnolog&amp;iacute;as&lt;/strong&gt; son las m&amp;aacute;s adecudas para llevarlo a cabo, decirte &lt;strong&gt;cuanto trabajo va a llevar hacerlo&lt;/strong&gt; y en consecuencia &lt;strong&gt;cuanto te va a costar&lt;/strong&gt;. Esto que parece sencillo creo que es el paso m&amp;aacute;s complicado, ese alguien debe estar al d&amp;iacute;a en lo referente a tecnolog&amp;iacute;as nuevas que hagan que tu proyecto se resuelva antes y ser bueno en &lt;strong&gt;estimar&lt;/strong&gt; cuanto tiempo va a llevar hacerlo &lt;strong&gt;para que no le suponga un problema al cliente&lt;/strong&gt; (sobrecoste) o &lt;strong&gt;al proveedor&lt;/strong&gt; (no poder cubrir gastos).&lt;/p&gt;

&lt;p&gt;Una vez decicido que es lo que se quiere hacer, pasa por alguien que sepa del &lt;strong&gt;aspecto art&amp;iacute;stico&lt;/strong&gt; plasmando los &lt;strong&gt;gr&amp;aacute;ficos&lt;/strong&gt; que compondran la p&amp;aacute;gina. Esta persona debe saber de &lt;strong&gt;usabilidad&lt;/strong&gt; y de las tendenc&amp;iacute;as actuales en dise&amp;ntilde;o.&lt;/p&gt;

&lt;p&gt;Con los gr&amp;aacute;ficos resueltos y validados por el cliente se pasa a un proceso de &lt;strong&gt;maquetaci&amp;oacute;n&lt;/strong&gt;, donde &lt;strong&gt;esos gr&amp;aacute;ficos se convierten en un c&amp;oacute;digo entendible por todos los navegadores web&lt;/strong&gt;. Aunque hay cada vez m&amp;aacute;s herramientas para aligerar el proceso, cada d&amp;iacute;a es m&amp;aacute;s complicado resolver este tema: m&amp;aacute;s navegadores (ordenadores, tabletas, m&amp;oacute;viles...) y con sus diferentes tama&amp;ntilde;os de pantalla que hay que adaptar.&lt;/p&gt;

&lt;p&gt;Luego se le da &lt;strong&gt;vida&lt;/strong&gt; al proyecto, pasando por las manos de &lt;strong&gt;un programador&lt;/strong&gt; que incluya esos aspectos no resueltos en maquetaci&amp;oacute;n, como almacenar los datos que el usuario introduce, operarlos, tratarlos y crear las conexiones requeridas con otros servicios. Esta persona deber&amp;aacute; saber varios lenguajes de programaci&amp;oacute;n y tener mucha idea de como funciona el proceso para ser eficiente.&lt;/p&gt;

&lt;p&gt;Una vez terminada la web, pasa a manos de alguien que la haga &lt;strong&gt;disponible al mundo&lt;/strong&gt;. Dej&amp;aacute;ndola accesible en un proveedor de alojamiento &lt;strong&gt;y de manera segura&lt;/strong&gt;, es decir, que se hagan copias de seguridad y que se entere (monitorizaci&amp;oacute;n) y corrija si hay alg&amp;uacute;n problema.&lt;/p&gt;

&lt;p&gt;Tambi&amp;eacute;n hay trabajo una vez publicada la p&amp;aacute;gina, pues alguien tiene que &lt;strong&gt;hacerla visible, &lt;/strong&gt;dando&amp;nbsp;de alta la p&amp;aacute;gina en los buscadores y seg&amp;uacute;n sea el proyecto planear acciones para aumentar la visibilidad.&lt;/p&gt;

&lt;p&gt;Evidentemente &lt;strong&gt;siempre hay atajos&lt;/strong&gt; para algunas de las partes del proceso, existen &lt;strong&gt;dise&amp;ntilde;os gen&amp;eacute;ricos&lt;/strong&gt; en venta muy baratos o &lt;strong&gt;aplicaciones pre-fabricadas&lt;/strong&gt; que hace que no se tenga que hacer la de programaci&amp;oacute;n. As&amp;iacute; se &lt;strong&gt;reducen las horas&lt;/strong&gt; del proyecto pues solo es necesario &lt;strong&gt;adaptar&lt;/strong&gt;, pero hay que evaluar cuanto tiempo llevar&amp;aacute; adaptarlo para que no sea m&amp;aacute;s caro que empezarlo desde cero.&amp;nbsp;&lt;/p&gt;

&lt;p&gt;Estos atajos &lt;strong&gt;no son aplicables para todos los proyectos&lt;/strong&gt; y seg&amp;uacute;n cuales sean sus necesidades implica algo muy &lt;strong&gt;contraproducente a la larga&lt;/strong&gt;. Imagine el reto que supone tener que adaptar una casa pre-fabricada para conseguir una mansi&amp;oacute;n. Iniciar&amp;aacute; la web de forma r&amp;aacute;pida y barata pero puede que tenga que empezar de cero si su p&amp;aacute;gina web empieza a hacerse grande.&lt;/p&gt;

&lt;p&gt;&lt;strong&gt;Encontrar a una &amp;uacute;nica persona&lt;/strong&gt; que sea buena en todos los roles &lt;strong&gt;es una utop&amp;iacute;a&lt;/strong&gt;. Como cada vez existen m&amp;aacute;s especializaciones en los roles, para un proyecto mediano/grande se requerir&amp;aacute; la interacci&amp;oacute;n de 4 personas como m&amp;iacute;nimo. Si contamos que &lt;strong&gt;hay pocos t&amp;eacute;cnicos especialistas,&lt;/strong&gt; el &lt;strong&gt;coste por hora es alto&lt;/strong&gt; y preveo que seguir&amp;aacute; subiendo si sigue aumentando la demanda.&lt;/p&gt;

&lt;p&gt;Espero que con todo esto, se &lt;strong&gt;haga una idea&lt;/strong&gt; de lo que implica hacer una p&amp;aacute;gina web y pueda hablar con los diferentes agentes que pretendan ayudarle con conocimiento de causa. Tampoco se sorprenda si por hacer alguna idea extravagante le presupuestan una barbaridad, &lt;strong&gt;todo se puede hacer&lt;/strong&gt;, pero hay cosas que lleva mucho &lt;strong&gt;tiempo hacerlas&lt;/strong&gt;, al menos, &lt;strong&gt;con las herramientas del momento&lt;/strong&gt;.&lt;/p&gt;

</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Sat, 14 Mar 2015 21:56:40 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2015/03/14/porque-es-tan-caro-hacer-una-pagina-web/</guid><enclosure url="http://www.eduherraiz.com/media/portfolio/uploads/zinnia/2015/03/14/money_keyboard.jpg" length="277676" type="image/jpeg"></enclosure><category>Reflexiones</category><category>Web</category></item></channel></rss>