<?xml version="1.0" encoding="utf-8"?>
<rss xmlns:atom="http://www.w3.org/2005/Atom" version="2.0"><channel><title>www.eduherraiz.com - Entradas de la categoría Python</title><link>http://www.eduherraiz.com/blog/categories/python/</link><description>Las últimas entradas de la categoría Python</description><atom:link href="http://www.eduherraiz.com/blog/feeds/categories/python/" rel="self"></atom:link><language>es</language><copyright>Zinnia</copyright><lastBuildDate>Fri, 13 Dec 2013 19:45:57 +0000</lastBuildDate><item><title>Foowill, un proyecto inútil que no lo fue tanto
</title><link>http://www.eduherraiz.com/blog/2013/12/13/foowill-un-proyecto-inutil-que-no-lo-fue-tanto/</link><description>&lt;p&gt;A principios de 2012 empecé con una aplicación para twitter, una donde pudieses guardar tweets que fuesen publicados en tu cuenta cuando mueras, todavía &lt;a href="http://www.eduherraiz.com/blog/nuevo-proyecto-foowill-com/"&gt;podéis leer la entrada inicial del proyecto&lt;/a&gt;. Ahora os escribo para hacer balance pues he decidido &lt;strong&gt;cerrar&lt;/strong&gt; este proyecto.&lt;/p&gt;

&lt;p&gt;Escogí esa idea no porque fuese una gran oportunidad de negocio, si no porque tenía ganas de &lt;strong&gt;aprender&lt;/strong&gt; a programar un proyecto entero con Django, y como novato, era preferible la idea más simple del cajón. Puede parecer que escoger una idea simple, sin futuro, y dedicarle tantas horas para al final cerrarla en poco tiempo es la perdida de tiempo más grande de mi carrera, pero revisando la cantidad de cosas para las que me ha servido este proyecto, me doy cuenta que ha sido &lt;strong&gt;uno de los mayores aciertos&lt;/strong&gt;.&lt;/p&gt;

&lt;p&gt;Para empezar, &lt;strong&gt;aprendí Django&lt;/strong&gt;, un framework que se me hacía una montaña ahora me está resultando cómodo y divertido a la hora de programar. Aplicándolo en el trabajo y con ganas de seguir aprendiendo a programar mejor.&lt;/p&gt;

&lt;p&gt;&lt;strong&gt;Encontré trabajo&lt;/strong&gt;, no especialmente por el proyecto de programación, pues ahora estoy administrando sistemas, pero si que salió a relucir en la entrevista y vistió mucho que estuviese haciendo algo tan raro como eso pudiendo estar jugando al counter strike.&lt;/p&gt;

&lt;p&gt;&lt;strong&gt;Mejoré mi imagen de marca.&lt;/strong&gt; Como la idea era muy morbosa, al hacerla pública, y sin querer, se enteraron los medios y me llamaron de diarios, radios y televisión para preguntarme por ella. Vino la televisión local -IB3- a casa a entrevistarme, escribieron en medios como &lt;a href="http://www.elmundo.es/elmundo/2012/10/11/baleares/1349973404.html"&gt;elmundo.es&lt;/a&gt; sobre ello y me llamaron de unas cuantas radios para que les hablase del tema. Muy divertido todo y prometo que no busqué ni una!&lt;/p&gt;

&lt;p&gt;Gracias a la repercusión, mi familia, amigos y vecinos me miran de otro modo, ya no soy ese informático que no se sabe muy bien que hace, y aunque no se muy bien si he ganado algo, creo que &lt;strong&gt;me respetan un poco más&lt;/strong&gt;.&lt;/p&gt;

&lt;p&gt;Ver que eres capaz de sacar adelante un proyecto entero te da la &lt;strong&gt;motivación para empezar más proyectos&lt;/strong&gt;, así ha sido en mi caso, pues ya está visible &lt;strong&gt;mi segundo proyecto&lt;/strong&gt; en Django: &lt;a href="http://vagi.be"&gt;http://vagi.be&lt;/a&gt;, un visor de webcams, que aunque todavía está en pañales, voy dedicándole horas para que avance.&lt;/p&gt;

&lt;p&gt;Cerrar el proyecto&lt;strong&gt; no ha sido una decisión fácil&lt;/strong&gt;, pero no tenía visitas y ya existen otras alternativas mucho mejores para este cometido, como por ejemplo &lt;a href="http://ifidie.net/"&gt;http://ifidie.net&lt;/a&gt;. Siento si alguien guardó algo importante que decir para la posteridad en foowill, pero no puedo mantener esa carga. He borrado todos los mensajes guardados y nunca los leerá nadie. &lt;strong&gt;Disculpas por ello y gracias por confiar&lt;/strong&gt; en foowill.com.&lt;/p&gt;

&lt;p&gt;Para el que le pueda servir he publicado &lt;a href="https://github.com/eduherraiz/foowill"&gt;el código bajo licencia MIT en github&lt;/a&gt;.&lt;/p&gt;
</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Fri, 13 Dec 2013 19:45:57 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2013/12/13/foowill-un-proyecto-inutil-que-no-lo-fue-tanto/</guid><category>Foowill</category><category>Programación</category><category>Python</category><category>Reflexiones</category></item><item><title>Nuevo proyecto: foowill.com
</title><link>http://www.eduherraiz.com/blog/2012/09/08/nuevo-proyecto-foowillcom/</link><description>&lt;p&gt;Al empezar el a&amp;ntilde;o y quedarme en paro, empec&amp;eacute; a programar una idea que ten&amp;iacute;a pensada, en principio para pasar el tiempo y de paso aprender cosas modernas en la programaci&amp;oacute;n de aplicaciones web.&lt;/p&gt;

&lt;p&gt;Ahora que la idea est&amp;aacute; online en &lt;a href="http://foowill.com"&gt;www.foowill.com&lt;/a&gt;,&amp;nbsp;os cuento un poco sobre ella. La idea es bastante simple, una aplicaci&amp;oacute;n que permita guardar tweets que ser&amp;aacute;n enviados a twitter tras la muerte del usuario. La manera de comprobar esto es mediante un bot que&amp;nbsp;peri&amp;oacute;dicamente&amp;nbsp;compruebe la linea temporal del usuario en busca de nuevas actualizaciones. En el caso de que pasado un tiempo (configurable) no se vean actualizaciones, se publicar&amp;aacute;n los post-tweets guardados.&amp;nbsp;Incluyo una &amp;uacute;ltima comprobaci&amp;oacute;n de emergencia a una direcci&amp;oacute;n de correo&amp;nbsp;electr&amp;oacute;nico, antes de publicar nada, si el usuario lo requiere.&lt;/p&gt;

&lt;p&gt;Sali&amp;oacute; hace poco una aplicaci&amp;oacute;n que sustancialmente hace lo mismo para facebook,&amp;nbsp;pod&amp;eacute;is&amp;nbsp;encontrar ese proyecto en&amp;nbsp;&lt;a href="http://ifidie.net/"&gt;http://ifidie.net/&lt;/a&gt;. Permite subir video y texto, pero requiere de la confianza en 3 amigos que verifiquen tu muerte. Incluso parece que hasta &lt;a href="http://es-us.noticias.yahoo.com/presentan-app-dejar-mensajes-p%C3%B3stumos-192800443.html"&gt;ya tienen modelo de negocio&lt;/a&gt;. Siguen saliendo aplicaciones parecidas como&amp;nbsp;&lt;a href="http://www.abc.es/20120901/internacional/abci-mensajes-postumos-iniciativa-latinoamericana-201208311858.html"&gt;pod&amp;eacute;is&amp;nbsp;leer aqu&amp;iacute;&lt;/a&gt;.&lt;/p&gt;

&lt;p&gt;Bueno, hablemos de tecnolog&amp;iacute;a. Yo ven&amp;iacute;a de programar en PHP, y lo &amp;uacute;ltimo con &lt;a href="http://www.symfony-project.org/installation/1_4"&gt;symfony 1.4&lt;/a&gt;, pero quer&amp;iacute;a probar algo m&amp;aacute;s moderno. Lo intent&amp;eacute; con &lt;a href="http://symfony.com/download"&gt;symfony 2&lt;/a&gt;&amp;nbsp;, que con los &lt;a href="http://knpbundles.com/"&gt;bundles&lt;/a&gt;, promet&amp;iacute;a ahorrar muchas horas evitando reinventar la rueda con seg&amp;uacute;n que cosas.&amp;nbsp;Al empezarlo con symfony 2, no me gust&amp;oacute; nada, los bundles, incluso los m&amp;aacute;s usados, no funcionaban a la primera, y al menos por mi parte, me desquiciaba tener que perder tiempo en soluciones que te ten&amp;iacute;an que hacer ganarlo. Lo dej&amp;eacute; correr por un tiempo y segu&amp;iacute; investigando sobre frameworks. Tras muchas pruebas estaba por empezarlo sin framework, la idea era tan simple que me aburr&amp;iacute;a no estar programando, pero al final encontr&amp;eacute; lo que necesitaba: &lt;strong&gt;Django&lt;/strong&gt;.&lt;/p&gt;

&lt;p&gt;Ya hab&amp;iacute;a probado &lt;a href="https://www.djangoproject.com/"&gt;Django&lt;/a&gt;, en una asignatura de &lt;a href="http://gallir.wordpress.com/"&gt;Ricardo Galli&lt;/a&gt;, no hice nada complicado y quiz&amp;aacute; por eso no le ve&amp;iacute;a tantas posibilidades al principio. Tambi&amp;eacute;n me interesaba utilizar algo que tuviese futuro profesionalmente y descubr&amp;iacute; que est&amp;aacute;n teniendo experiencias muy positivas con &amp;eacute;l en &lt;a href="http://www.apsl.net/"&gt;apsl.net&lt;/a&gt;&amp;nbsp;y &amp;nbsp;&lt;a href="http://www.roiback.es/"&gt;roiback.es&lt;/a&gt;&amp;nbsp;(que conoc&amp;iacute; m&amp;aacute;s tarde). Mis primeras&amp;nbsp;b&amp;uacute;squedas&amp;nbsp;fueron para encontrar alg&amp;uacute;n plugin para django que me permitiese logearme en una aplicaci&amp;oacute;n con &lt;a href="https://twitter.com/"&gt;twitter&lt;/a&gt;. Encontr&amp;eacute; de los primeros&amp;nbsp;&lt;a href="https://github.com/omab/django-social-auth"&gt;django-social-auth&lt;/a&gt;, que no solo me permit&amp;iacute;a conectar con twitter, sino con muchas redes sociales m&amp;aacute;s. Al probarlo todo funcion&amp;oacute; a la primera sin tocar casi nada. Eso bast&amp;oacute; para enamorar a un programador tan vago como yo. Segu&amp;iacute; descubriendo herramientas de python y django para darme cuenta que se ahorran muchas horas si pierdes un rato en hacer las cosas bien. La utilizaci&amp;oacute;n de &lt;a href="http://pypi.python.org/pypi/virtualenv"&gt;entornos virtuales&lt;/a&gt;, &lt;a href="http://docs.fabfile.org/en/1.4.3/index.html"&gt;fabric&lt;/a&gt; para los deploys, &lt;a href="http://pypi.python.org/pypi/South/"&gt;south&lt;/a&gt; para las migraciones de bases de datos y &lt;a href="https://github.com/rfk/django-supervisor"&gt;supervisor&lt;/a&gt; para arrancar las partes de una aplicaci&amp;oacute;n son indispensables para m&amp;iacute; ahora.&lt;/p&gt;

&lt;p&gt;Para esta aplicaci&amp;oacute;n tambi&amp;eacute;n utilizo &lt;a href="http://celeryproject.org/"&gt;celery&lt;/a&gt; para las tareas&amp;nbsp;peri&amp;oacute;dicas&amp;nbsp;del bot que comprueba tu estado en twitter.&amp;nbsp;Como utilizo redis para las colas de celery, tambi&amp;eacute;n lo aprovecho para cachear p&amp;aacute;ginas y todo funciona muy bien. Y una vez hecha la aplicaci&amp;oacute;n, y en los intermedios de una pel&amp;iacute;cula de antena3, consegu&amp;iacute; hacer funcionar un backend que trae el propio django. 17 lineas de c&amp;oacute;digo!&lt;/p&gt;

&lt;p&gt;De mis conocimiento de Django debo agradecer parte a &lt;a href="https://twitter.com/aaloy"&gt;Antoni Aloy&lt;/a&gt;,&amp;nbsp;&lt;a href="http://trespams.com/"&gt;por las muy buenas entradas en su blog&lt;/a&gt;&amp;nbsp; y sus comentarios en twitter&amp;nbsp;que siempre me ayudaron. :) Aparte del framework, utilizo &lt;a href="http://twitter.github.com/bootstrap/"&gt;bootstrap&lt;/a&gt; para ayudar en el dise&amp;ntilde;o, con el que he conseguido, y sin pelearme mucho, un dise&amp;ntilde;o que se adapta a m&amp;uacute;ltiples tama&amp;ntilde;os de pantalla. Para el dise&amp;ntilde;o en css tambi&amp;eacute;n&amp;nbsp;utilizo&amp;nbsp;&lt;a href="http://lesscss.org/"&gt;less&lt;/a&gt;, para crear funciones css y ahorrar c&amp;oacute;digo.&amp;nbsp;&lt;/p&gt;

&lt;p&gt;En la base de datos uso&amp;nbsp;&lt;a href="http://www.postgresql.org/"&gt;postgresql&lt;/a&gt;&amp;nbsp;como gestor. Una aplicaci&amp;oacute;n por muy simple que parezca siempre llevar&amp;aacute; un mont&amp;oacute;n de horas asociadas. Para esta en particular he necesitado unas 500, aunque gran parte son del aprendizaje del framework y tecnolog&amp;iacute;as asociadas. Para m&amp;iacute;, aprender django no ha sido algo traum&amp;aacute;tico, y aunque tiene sus cosas, todo es bastante natural y divertido. En definitiva, he conseguido lanzar una aplicaci&amp;oacute;n original que ya veremos si funciona, pero lo que no me quita nadie es que he podido subir un poquito el list&amp;oacute;n de mi programaci&amp;oacute;n web y estar preparado para empezar nuevos y m&amp;aacute;s grandes&amp;nbsp;retos.&lt;/p&gt;

&lt;center&gt;&lt;p&gt;&lt;img alt="" src="/media/portfolio/uploads/2014/12/27/ba_square_big.jpg" style="height:350px; width:350px" /&gt;&lt;/p&gt;&lt;/center&gt;
</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Sat, 08 Sep 2012 00:53:37 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2012/09/08/nuevo-proyecto-foowillcom/</guid><enclosure url="http://www.eduherraiz.com/media/portfolio/uploads/2014/12/27/ba_square_big.jpg" length="100000" type="image/jpeg"></enclosure><category>Django</category><category>Foowill</category><category>Programación</category><category>Python</category></item></channel></rss>