<?xml version="1.0" encoding="utf-8"?>
<rss xmlns:atom="http://www.w3.org/2005/Atom" version="2.0"><channel><title>www.eduherraiz.com - Entradas del tag reflexion</title><link>http://www.eduherraiz.com/blog/tags/reflexion/</link><description>Las últimas entradas del tag reflexion</description><atom:link href="http://www.eduherraiz.com/blog/feeds/tags/reflexion/" rel="self"></atom:link><language>es</language><copyright>Zinnia</copyright><lastBuildDate>Sun, 05 Jun 2011 11:00:10 +0000</lastBuildDate><item><title>¿Sabiduría o inteligencia?
</title><link>http://www.eduherraiz.com/blog/2011/06/05/sabiduria-o-inteligencia/</link><description>&lt;p&gt;La sabidur&amp;iacute;a hace referencia a los conocimientos que ya se tienen, a las premisas que un aparato l&amp;oacute;gico como nuestro cerebro utiliza para sacar conclusiones. En cambio, la inteligencia es la capacidad de comprender o de adquirir nuevo conocimiento de una situaci&amp;oacute;n. Para adquirir conocimiento e incrementar la sabidur&amp;iacute;a no necesariamente se ha tenido que aplicar la inteligencia. Podemos leer un postulado,&amp;nbsp; comprender el camino l&amp;oacute;gico que lleva hasta ah&amp;iacute; y asimilar ese conocimiento como certero.&amp;nbsp; La persona inteligente es la que lo descubri&amp;oacute; sin ayuda. Por ejemplo, yo entiendo en alguna medida la teor&amp;iacute;a de la relatividad, pero no tengo la inteligencia para deducirla como hizo Einstein. Ante la disyuntiva del titular&amp;nbsp; es dif&amp;iacute;cil para m&amp;iacute; escoger que es lo que tiene m&amp;aacute;s valor. Socialmente se da m&amp;aacute;s valor a la inteligencia. Eso lo aprend&amp;iacute; de muy peque&amp;ntilde;o, estando en el colegio. No recuerdo la edad exacta, pero con menos de 9 a&amp;ntilde;os. Un d&amp;iacute;a el profesor puso la siguiente frase en la pizarra: &amp;quot;&lt;em&gt;d&amp;aacute;bale arroz a la zorra el abad&lt;/em&gt;&amp;quot;; dici&amp;eacute;ndonos a los alumnos que si alguno sab&amp;iacute;a que ten&amp;iacute;a de especial esa frase, se levantase y fuese a dec&amp;iacute;rselo al o&amp;iacute;do. Yo me percat&amp;eacute; en ese momento de la cualidad de &lt;a href="http://buscon.rae.es/draeI/SrvltGUIBusUsual?LEMA=pal%C3%ADndromo&amp;amp;origen=RAE"&gt;pal&amp;iacute;ndromo&lt;/a&gt; de la oraci&amp;oacute;n aplicando mi inteligencia. As&amp;iacute; fui a dec&amp;iacute;rselo al profesor junto a otros dos alumnos m&amp;aacute;s. El profesor nos felicit&amp;oacute; por haber acertado todos y resolvi&amp;oacute; el misterio para el resto de la clase, pero luego vino el momento interesante: nos pregunt&amp;oacute; a los tres alumnos si ya lo sab&amp;iacute;amos o si lo hab&amp;iacute;amos deducido al momento de ver la frase. Yo contest&amp;eacute; primero, mintiendo, diciendo que ya lo sab&amp;iacute;a de antes, confiado en que la sabidur&amp;iacute;a era mucho m&amp;aacute;s valiosa que la inteligencia, en cambio, los otros dos contestaron lo contrario. Para mi sorpresa, el profesor engrandeci&amp;oacute; el logro de mis dos compa&amp;ntilde;eros despreciando mi supuesta sabidur&amp;iacute;a declarada. Desde ese d&amp;iacute;a, tengo la mala costumbre de&amp;nbsp; hacer ver, en los hechos que as&amp;iacute; lo permiten, que resolv&amp;iacute; el problema con&amp;nbsp; mi inteligencia no con mi sabidur&amp;iacute;a, aunque no fuese el caso. Ahora veo que es ultracomplicado conseguir un alto grado de sabidur&amp;iacute;a, que alguno no naci&amp;oacute; con el don de la inteligencia, pero a base de constancia y buen trabajo puede dar lecciones a m&amp;aacute;s de un inteligente. Y creo que esto se debe valorar, hasta incluso m&amp;aacute;s, que la propia inteligencia.&lt;/p&gt;

</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Sun, 05 Jun 2011 11:00:10 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2011/06/05/sabiduria-o-inteligencia/</guid><category>Reflexiones</category></item></channel></rss>