<?xml version="1.0" encoding="utf-8"?>
<rss xmlns:atom="http://www.w3.org/2005/Atom" version="2.0"><channel><title>www.eduherraiz.com - Entradas de la categoría Reflexiones</title><link>http://www.eduherraiz.com/blog/categories/reflexiones/</link><description>Las últimas entradas de la categoría Reflexiones</description><atom:link href="http://www.eduherraiz.com/blog/feeds/categories/reflexiones/" rel="self"></atom:link><language>es</language><copyright>Zinnia</copyright><lastBuildDate>Sat, 14 Mar 2015 21:56:40 +0000</lastBuildDate><item><title>¿Porqué es tan caro hacer una página web?
</title><link>http://www.eduherraiz.com/blog/2015/03/14/porque-es-tan-caro-hacer-una-pagina-web/</link><description>&lt;p&gt;&lt;span style="line-height: 20.7999992370605px;"&gt;Ultimamente m&lt;/span&gt;e he encontrado varias ocasiones&amp;nbsp;donde se pone en duda el &lt;strong&gt;alto coste&lt;/strong&gt; que tiene hacer una &lt;strong&gt;p&amp;aacute;gina web&lt;/strong&gt; o donde se busca a una persona &amp;uacute;nica que la haga, como si eso fuese a salir m&amp;aacute;s barato.&amp;nbsp;&lt;br /&gt;
Como creo que es porque se desconoce todo lo que se necesita para llevar a cabo un proyecto voy a intentar introducir el proceso sin entrar en tecnicismos.&lt;/p&gt;

&lt;p&gt;Para empezar, alguien tiene que entender &lt;strong&gt;que es lo que quieres&lt;/strong&gt;, que &lt;strong&gt;tecnolog&amp;iacute;as&lt;/strong&gt; son las m&amp;aacute;s adecudas para llevarlo a cabo, decirte &lt;strong&gt;cuanto trabajo va a llevar hacerlo&lt;/strong&gt; y en consecuencia &lt;strong&gt;cuanto te va a costar&lt;/strong&gt;. Esto que parece sencillo creo que es el paso m&amp;aacute;s complicado, ese alguien debe estar al d&amp;iacute;a en lo referente a tecnolog&amp;iacute;as nuevas que hagan que tu proyecto se resuelva antes y ser bueno en &lt;strong&gt;estimar&lt;/strong&gt; cuanto tiempo va a llevar hacerlo &lt;strong&gt;para que no le suponga un problema al cliente&lt;/strong&gt; (sobrecoste) o &lt;strong&gt;al proveedor&lt;/strong&gt; (no poder cubrir gastos).&lt;/p&gt;

&lt;p&gt;Una vez decicido que es lo que se quiere hacer, pasa por alguien que sepa del &lt;strong&gt;aspecto art&amp;iacute;stico&lt;/strong&gt; plasmando los &lt;strong&gt;gr&amp;aacute;ficos&lt;/strong&gt; que compondran la p&amp;aacute;gina. Esta persona debe saber de &lt;strong&gt;usabilidad&lt;/strong&gt; y de las tendenc&amp;iacute;as actuales en dise&amp;ntilde;o.&lt;/p&gt;

&lt;p&gt;Con los gr&amp;aacute;ficos resueltos y validados por el cliente se pasa a un proceso de &lt;strong&gt;maquetaci&amp;oacute;n&lt;/strong&gt;, donde &lt;strong&gt;esos gr&amp;aacute;ficos se convierten en un c&amp;oacute;digo entendible por todos los navegadores web&lt;/strong&gt;. Aunque hay cada vez m&amp;aacute;s herramientas para aligerar el proceso, cada d&amp;iacute;a es m&amp;aacute;s complicado resolver este tema: m&amp;aacute;s navegadores (ordenadores, tabletas, m&amp;oacute;viles...) y con sus diferentes tama&amp;ntilde;os de pantalla que hay que adaptar.&lt;/p&gt;

&lt;p&gt;Luego se le da &lt;strong&gt;vida&lt;/strong&gt; al proyecto, pasando por las manos de &lt;strong&gt;un programador&lt;/strong&gt; que incluya esos aspectos no resueltos en maquetaci&amp;oacute;n, como almacenar los datos que el usuario introduce, operarlos, tratarlos y crear las conexiones requeridas con otros servicios. Esta persona deber&amp;aacute; saber varios lenguajes de programaci&amp;oacute;n y tener mucha idea de como funciona el proceso para ser eficiente.&lt;/p&gt;

&lt;p&gt;Una vez terminada la web, pasa a manos de alguien que la haga &lt;strong&gt;disponible al mundo&lt;/strong&gt;. Dej&amp;aacute;ndola accesible en un proveedor de alojamiento &lt;strong&gt;y de manera segura&lt;/strong&gt;, es decir, que se hagan copias de seguridad y que se entere (monitorizaci&amp;oacute;n) y corrija si hay alg&amp;uacute;n problema.&lt;/p&gt;

&lt;p&gt;Tambi&amp;eacute;n hay trabajo una vez publicada la p&amp;aacute;gina, pues alguien tiene que &lt;strong&gt;hacerla visible, &lt;/strong&gt;dando&amp;nbsp;de alta la p&amp;aacute;gina en los buscadores y seg&amp;uacute;n sea el proyecto planear acciones para aumentar la visibilidad.&lt;/p&gt;

&lt;p&gt;Evidentemente &lt;strong&gt;siempre hay atajos&lt;/strong&gt; para algunas de las partes del proceso, existen &lt;strong&gt;dise&amp;ntilde;os gen&amp;eacute;ricos&lt;/strong&gt; en venta muy baratos o &lt;strong&gt;aplicaciones pre-fabricadas&lt;/strong&gt; que hace que no se tenga que hacer la de programaci&amp;oacute;n. As&amp;iacute; se &lt;strong&gt;reducen las horas&lt;/strong&gt; del proyecto pues solo es necesario &lt;strong&gt;adaptar&lt;/strong&gt;, pero hay que evaluar cuanto tiempo llevar&amp;aacute; adaptarlo para que no sea m&amp;aacute;s caro que empezarlo desde cero.&amp;nbsp;&lt;/p&gt;

&lt;p&gt;Estos atajos &lt;strong&gt;no son aplicables para todos los proyectos&lt;/strong&gt; y seg&amp;uacute;n cuales sean sus necesidades implica algo muy &lt;strong&gt;contraproducente a la larga&lt;/strong&gt;. Imagine el reto que supone tener que adaptar una casa pre-fabricada para conseguir una mansi&amp;oacute;n. Iniciar&amp;aacute; la web de forma r&amp;aacute;pida y barata pero puede que tenga que empezar de cero si su p&amp;aacute;gina web empieza a hacerse grande.&lt;/p&gt;

&lt;p&gt;&lt;strong&gt;Encontrar a una &amp;uacute;nica persona&lt;/strong&gt; que sea buena en todos los roles &lt;strong&gt;es una utop&amp;iacute;a&lt;/strong&gt;. Como cada vez existen m&amp;aacute;s especializaciones en los roles, para un proyecto mediano/grande se requerir&amp;aacute; la interacci&amp;oacute;n de 4 personas como m&amp;iacute;nimo. Si contamos que &lt;strong&gt;hay pocos t&amp;eacute;cnicos especialistas,&lt;/strong&gt; el &lt;strong&gt;coste por hora es alto&lt;/strong&gt; y preveo que seguir&amp;aacute; subiendo si sigue aumentando la demanda.&lt;/p&gt;

&lt;p&gt;Espero que con todo esto, se &lt;strong&gt;haga una idea&lt;/strong&gt; de lo que implica hacer una p&amp;aacute;gina web y pueda hablar con los diferentes agentes que pretendan ayudarle con conocimiento de causa. Tampoco se sorprenda si por hacer alguna idea extravagante le presupuestan una barbaridad, &lt;strong&gt;todo se puede hacer&lt;/strong&gt;, pero hay cosas que lleva mucho &lt;strong&gt;tiempo hacerlas&lt;/strong&gt;, al menos, &lt;strong&gt;con las herramientas del momento&lt;/strong&gt;.&lt;/p&gt;

</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Sat, 14 Mar 2015 21:56:40 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2015/03/14/porque-es-tan-caro-hacer-una-pagina-web/</guid><enclosure url="http://www.eduherraiz.com/media/portfolio/uploads/zinnia/2015/03/14/money_keyboard.jpg" length="277676" type="image/jpeg"></enclosure><category>Reflexiones</category><category>Web</category></item><item><title>Troleando al sysadmin de los tranvías de Zaragoza (aclaración)
</title><link>http://www.eduherraiz.com/blog/2014/11/12/troleando-al-sysadmin-de-los-tranvias-de-zaragoza-aclaracion/</link><description>&lt;p&gt;Ayer estuve involucrado en un v&amp;iacute;deo que se hizo viral de manera muy r&amp;aacute;pida y me gustar&amp;iacute;a aclarar un par de cosas que han quedado fuera de contexto. El v&amp;iacute;deo transcurre en una &lt;strong&gt;parada del tranv&amp;iacute;a de Zaragoza&lt;/strong&gt;,&amp;nbsp;hab&amp;iacute;amos sacado los billetes de una m&amp;aacute;quina de venta y est&amp;aacute;bamos esperando que llegase&amp;nbsp;el pr&amp;oacute;ximo tranv&amp;iacute;a. De repente, empiezan a aparecer men&amp;uacute;s contextuales y ventanas de un&lt;strong&gt; escritorio Windows&lt;/strong&gt;. Alguien estaba operando de forma remota para actualizar algunos programas. Decidimos grabarlo y alguien toc&amp;oacute;&amp;nbsp;a ver si pod&amp;iacute;amos operar nosotros tambi&amp;eacute;n con la pantalla t&amp;aacute;ctil, molestamos un poco al operador y nos echamos unas risas. &lt;strong&gt;El sistema no se vio perjudicado y nos fuimos en cuanto lleg&amp;oacute; el tranv&amp;iacute;a&lt;/strong&gt;. Eramos parte de la &lt;strong&gt;comitiva mallorquina&lt;/strong&gt; que estuvo en Zaragoza en la &lt;a href="http://2014.es.pycon.org/"&gt;PyConEs2014&lt;/a&gt;:&amp;nbsp;administradores de sistemas &lt;strong&gt;Linux&lt;/strong&gt;, programadores y &lt;strong&gt;apasionados de la tecnolog&amp;iacute;a&lt;/strong&gt; (eso adem&amp;aacute;s nos llev&amp;oacute; a viajar ese fin de semana). Yo especialmente,&lt;strong&gt; me re&amp;iacute; much&amp;iacute;simo&lt;/strong&gt; con este caso, no llegaba a comprender como se puede mantener un sistema as&amp;iacute;. Era un compendio de malas decisiones:&lt;/p&gt;

&lt;p&gt;&lt;strong&gt;Mala elecci&amp;oacute;n de sistema operativo&lt;/strong&gt;, sin entrar en otras mil razones, un sistema que se tiene que actualizar de manera remota es mucho mejor que tenga un&amp;nbsp;sistemas de paquetes para evitar estas intervenciones manuales.&lt;/p&gt;

&lt;p&gt;Se podr&amp;iacute;a&amp;nbsp;haber hecho&amp;nbsp;&lt;strong&gt;una intervenci&amp;oacute;n nocturna,&lt;/strong&gt; para evitar coincidir con los usuarios.&lt;/p&gt;

&lt;p&gt;Se podr&amp;iacute;a haber realizado un &lt;strong&gt;buen sistema de gesti&amp;oacute;n remota&lt;/strong&gt; para bloquear la pantalla t&amp;aacute;ctil de la m&amp;aacute;quina remota y que no se mostrase nada al usuario.&lt;/p&gt;

&lt;p&gt;Al llegar a la isla, publicamos el v&amp;iacute;deo en youtube y yo puse un tweet para compartirlo. &lt;strong&gt;Se hizo viral y&amp;nbsp;&lt;/strong&gt;por la tarde estaba &lt;a href="https://www.meneame.net/story/trolleando-sysadmin-tranvias-zaragoza"&gt;en portada de men&amp;eacute;ame&lt;/a&gt;&amp;nbsp; y alg&amp;uacute;n que otro lugar con tr&amp;aacute;fico. Debatimos en el grupo y &lt;strong&gt;decidimos auto-censurarnos&lt;/strong&gt;. El v&amp;iacute;deo se ve&amp;iacute;a sin el contexto y no favorece en nada a nuestra imagen. Aunque a nosotros nos averg&amp;uuml;ence que todo el mundo vea como nos re&amp;iacute;mos de este sistema, lo &lt;strong&gt;que deber&amp;iacute;a darnos verg&amp;uuml;enza a todos&amp;nbsp;&lt;/strong&gt;es que nuestras administraciones se gasten una barbaridad de dinero de nuestros impuestos en pagar a corporaciones americanas por sistemas operativos de juguete y sistemas con tan poca calidad como este. Mucho m&amp;aacute;s cuando vecinos nuestros como &lt;a href="http://www.somoslibres.org/modules.php?name=News&amp;amp;file=article&amp;amp;sid=3795"&gt;alemanes o franceses llevan a&amp;ntilde;os implementando casos de &amp;eacute;xito de software libre en las administraciones&lt;/a&gt;. Aunque se que &lt;strong&gt;seguramente esto no se har&amp;aacute; tan viral como lo de ayer&lt;/strong&gt;, ten&amp;iacute;a que perder un rato de mis preciadas vacaciones en aclararlo. Por cierto, me llevo un gran recuerdo de&amp;nbsp;Zaragoza, es una ciudad muy bonita, con gente muy amable y divertida, que creo que se ha visto arrastrada&amp;nbsp;por sus pol&amp;iacute;ticos hacia obras fara&amp;oacute;nicas igual que en muchas partes de Espa&amp;ntilde;a&amp;nbsp;(Mallorca entre ellas).&lt;/p&gt;

&lt;center&gt;&lt;p&gt;&lt;img alt="" src="/media/portfolio/uploads/2014/12/27/zaragoza_tranvia.jpg" style="height:420px; width:420px" /&gt;&lt;/p&gt;&lt;/center&gt;
</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Wed, 12 Nov 2014 11:54:51 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2014/11/12/troleando-al-sysadmin-de-los-tranvias-de-zaragoza-aclaracion/</guid><enclosure url="http://www.eduherraiz.com/media/portfolio/uploads/2014/12/27/zaragoza_tranvia.jpg" length="100000" type="image/jpeg"></enclosure><category>Reflexiones</category></item><item><title>Cambiando de aires
</title><link>http://www.eduherraiz.com/blog/2014/05/16/cambiando-de-aires/</link><description>&lt;p&gt;Este mes me cambio de trabajo, hoy &lt;strong&gt;dejo&amp;nbsp;mi puesto&lt;/strong&gt;&amp;nbsp;en &lt;a href="http://www.mola.com"&gt;mola.com&lt;/a&gt;&amp;nbsp;para entrar &amp;nbsp;haciendo m&amp;aacute;s o menos lo mismo en &lt;a href="http://www.apsl.net"&gt;apsl.net&lt;/a&gt;. &lt;strong&gt;No busqu&amp;eacute; este&amp;nbsp;cambio&lt;/strong&gt;, fue despu&amp;eacute;s de que los amigos de apsl me ofrecieran el puesto cuando medit&amp;eacute; que es lo que m&amp;aacute;s me conven&amp;iacute;a para mi futuro y os voy a intentar comentar las&amp;nbsp;razones que me han llevado a cambiar. A&amp;uacute;n recuerdo cuando antes de entrar en mola buscaba&amp;nbsp;trabajo en Mallorca, uno&amp;nbsp;donde pudiese seguir &lt;strong&gt;trabajando con Linux&lt;/strong&gt; a diario y donde pudiese seguir &lt;strong&gt;aprendiendo&lt;/strong&gt;. Con mi humilde curriculum y poca experiencia, &lt;strong&gt;en mola apostaron por m&amp;iacute;&lt;/strong&gt;, ofreci&amp;eacute;ndome un puesto al que me cost&amp;oacute; acostumbrarme, pues me ven&amp;iacute;a como un traje grande. Pero gracias a eso crec&amp;iacute; y &lt;strong&gt;aprend&amp;iacute; mucho m&amp;aacute;s r&amp;aacute;pido&lt;/strong&gt; de lo que lo hab&amp;iacute;a hecho nunca y eso que hasta esa fecha cre&amp;iacute;a que me hab&amp;iacute;a esforzado en hacer las cosas bien. Ahora me encontraba c&amp;oacute;modo, los retos m&amp;aacute;s grandes de reordenaci&amp;oacute;n de la cuenta de mola estaban resueltos y ya no quedaba nada de como me lo encontr&amp;eacute;. Hab&amp;iacute;amos conseguido reducir costes, agilizar instalaciones y la mayor&amp;iacute;a de las tareas repetitivas est&amp;aacute;n automatizadas. Incluso llegamos a cambiar la tecnolog&amp;iacute;a utilizada en los proyectos y en mi &amp;uacute;ltimo proyecto participado dimos un gran paso adelante en cuanto a tecnolog&amp;iacute;a y metodolog&amp;iacute;a. Por supuesto que quedan retos, pero &lt;strong&gt;mantenerse&lt;/strong&gt;&amp;nbsp;como administrador &lt;strong&gt;acomodado&lt;/strong&gt; solo me llevaba a avanzar&lt;strong&gt;&amp;nbsp;cada vez&amp;nbsp;m&amp;aacute;s lento&lt;/strong&gt;, era inevitable. Os har&amp;eacute; una analog&amp;iacute;a que creo que encaja bien, es como cuando debes &lt;strong&gt;podar un &amp;aacute;rbol&lt;/strong&gt; para que siga creciendo. Salir de la empresa, perder todas las responsabilidades y empezar de cero, era la &amp;uacute;nica manera y creo fuertemente que esto me llevar&amp;aacute; a crecer&amp;nbsp;m&amp;aacute;s y m&amp;aacute;s r&amp;aacute;pido. Conocer gente nueva, nuevas metodolog&amp;iacute;as y visiones espero que sea lo m&amp;aacute;s provechoso para mi carrera. Me voy &lt;strong&gt;orgulloso&lt;/strong&gt; del trabajo realizado y muy contento por la gente que he tenido oportunidad de conocer y aprovechar su conocimiento. Desde aqu&amp;iacute; &lt;strong&gt;gracias a todos ellos&lt;/strong&gt;. Aunque seguro que con m&amp;aacute;s de uno me terminar&amp;eacute; cruzando de nuevo de vez en cuando, Mallorca es un pa&amp;ntilde;uelo. Ahora estoy &lt;strong&gt;emocionado&lt;/strong&gt; por el&amp;nbsp;nuevo reto, con ganas de entrar en un grupo en le que hacen las cosas muy bien, y as&amp;iacute; como me han servido de referencia desde fuera, me hagan crecer estando dentro. Seguro que voy a tener que esforzarme mucho de nuevo.&amp;nbsp;&lt;/p&gt;

&lt;center&gt;&lt;p&gt;&lt;img alt="" src="/media/portfolio/uploads/2014/12/27/mola.jpg" style="height:480px; width:640px" /&gt;&lt;/p&gt;&lt;/center&gt;
</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Fri, 16 May 2014 11:11:20 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2014/05/16/cambiando-de-aires/</guid><enclosure url="http://www.eduherraiz.com/media/portfolio/uploads/2014/12/27/mola.jpg" length="100000" type="image/jpeg"></enclosure><category>Reflexiones</category></item><item><title>Foowill, un proyecto inútil que no lo fue tanto
</title><link>http://www.eduherraiz.com/blog/2013/12/13/foowill-un-proyecto-inutil-que-no-lo-fue-tanto/</link><description>&lt;p&gt;A principios de 2012 empecé con una aplicación para twitter, una donde pudieses guardar tweets que fuesen publicados en tu cuenta cuando mueras, todavía &lt;a href="http://www.eduherraiz.com/blog/nuevo-proyecto-foowill-com/"&gt;podéis leer la entrada inicial del proyecto&lt;/a&gt;. Ahora os escribo para hacer balance pues he decidido &lt;strong&gt;cerrar&lt;/strong&gt; este proyecto.&lt;/p&gt;

&lt;p&gt;Escogí esa idea no porque fuese una gran oportunidad de negocio, si no porque tenía ganas de &lt;strong&gt;aprender&lt;/strong&gt; a programar un proyecto entero con Django, y como novato, era preferible la idea más simple del cajón. Puede parecer que escoger una idea simple, sin futuro, y dedicarle tantas horas para al final cerrarla en poco tiempo es la perdida de tiempo más grande de mi carrera, pero revisando la cantidad de cosas para las que me ha servido este proyecto, me doy cuenta que ha sido &lt;strong&gt;uno de los mayores aciertos&lt;/strong&gt;.&lt;/p&gt;

&lt;p&gt;Para empezar, &lt;strong&gt;aprendí Django&lt;/strong&gt;, un framework que se me hacía una montaña ahora me está resultando cómodo y divertido a la hora de programar. Aplicándolo en el trabajo y con ganas de seguir aprendiendo a programar mejor.&lt;/p&gt;

&lt;p&gt;&lt;strong&gt;Encontré trabajo&lt;/strong&gt;, no especialmente por el proyecto de programación, pues ahora estoy administrando sistemas, pero si que salió a relucir en la entrevista y vistió mucho que estuviese haciendo algo tan raro como eso pudiendo estar jugando al counter strike.&lt;/p&gt;

&lt;p&gt;&lt;strong&gt;Mejoré mi imagen de marca.&lt;/strong&gt; Como la idea era muy morbosa, al hacerla pública, y sin querer, se enteraron los medios y me llamaron de diarios, radios y televisión para preguntarme por ella. Vino la televisión local -IB3- a casa a entrevistarme, escribieron en medios como &lt;a href="http://www.elmundo.es/elmundo/2012/10/11/baleares/1349973404.html"&gt;elmundo.es&lt;/a&gt; sobre ello y me llamaron de unas cuantas radios para que les hablase del tema. Muy divertido todo y prometo que no busqué ni una!&lt;/p&gt;

&lt;p&gt;Gracias a la repercusión, mi familia, amigos y vecinos me miran de otro modo, ya no soy ese informático que no se sabe muy bien que hace, y aunque no se muy bien si he ganado algo, creo que &lt;strong&gt;me respetan un poco más&lt;/strong&gt;.&lt;/p&gt;

&lt;p&gt;Ver que eres capaz de sacar adelante un proyecto entero te da la &lt;strong&gt;motivación para empezar más proyectos&lt;/strong&gt;, así ha sido en mi caso, pues ya está visible &lt;strong&gt;mi segundo proyecto&lt;/strong&gt; en Django: &lt;a href="http://vagi.be"&gt;http://vagi.be&lt;/a&gt;, un visor de webcams, que aunque todavía está en pañales, voy dedicándole horas para que avance.&lt;/p&gt;

&lt;p&gt;Cerrar el proyecto&lt;strong&gt; no ha sido una decisión fácil&lt;/strong&gt;, pero no tenía visitas y ya existen otras alternativas mucho mejores para este cometido, como por ejemplo &lt;a href="http://ifidie.net/"&gt;http://ifidie.net&lt;/a&gt;. Siento si alguien guardó algo importante que decir para la posteridad en foowill, pero no puedo mantener esa carga. He borrado todos los mensajes guardados y nunca los leerá nadie. &lt;strong&gt;Disculpas por ello y gracias por confiar&lt;/strong&gt; en foowill.com.&lt;/p&gt;

&lt;p&gt;Para el que le pueda servir he publicado &lt;a href="https://github.com/eduherraiz/foowill"&gt;el código bajo licencia MIT en github&lt;/a&gt;.&lt;/p&gt;
</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Fri, 13 Dec 2013 19:45:57 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2013/12/13/foowill-un-proyecto-inutil-que-no-lo-fue-tanto/</guid><category>Foowill</category><category>Programación</category><category>Python</category><category>Reflexiones</category></item><item><title>Despedida del IFISC
</title><link>http://www.eduherraiz.com/blog/2012/02/03/despedida-del-ifisc/</link><description>&lt;p&gt;Llevo un mes reposando esta entrada para&amp;nbsp;escribirla&amp;nbsp;de la mejor manera. La primera intentona fue en tono triste, no me gust&amp;oacute; y decid&amp;iacute; dejarlo para cuando lo viese con m&amp;aacute;s perspectiva. &lt;strong&gt;Desde que empez&amp;oacute; el a&amp;ntilde;o&lt;/strong&gt; ya &lt;strong&gt;no estoy&lt;/strong&gt; en mi habitual&amp;nbsp;puesto de trabajo &lt;strong&gt;en el IFISC&lt;/strong&gt; (&lt;a href="http://ifisc.uib-csic.es/"&gt;Instituto de F&amp;iacute;sica Interdisciplinar y Sistemas Complejos&lt;/a&gt;), un nombre muy largo para un instituto de investigaci&amp;oacute;n en f&amp;iacute;sica situado en la UIB (&lt;a href="http://www.uib.es/"&gt;Universitat de les Illes Balears&lt;/a&gt;) y a medias con el CSIC (&lt;a href="http://www.csic.es/"&gt;Consejo Superior de Investigaciones Cient&amp;iacute;ficas&lt;/a&gt;).&amp;nbsp;&lt;/p&gt;

&lt;p&gt;Es un buen sitio para trabajar, con gente joven preparando su doctorado, muchos post-doctorales internacionales y grandes&amp;nbsp;cient&amp;iacute;ficos titulares de nivel reconocido&amp;nbsp;mundialmente. Entr&amp;eacute; all&amp;iacute; reci&amp;eacute;n acabada la carrera, tanto, que tan s&amp;oacute;lo a los cuatro d&amp;iacute;as de tener el t&amp;iacute;tulo empec&amp;eacute;. En total &lt;strong&gt;estuve por m&amp;aacute;s de tres a&amp;ntilde;os&lt;/strong&gt; y os debo reconocer que se me pasaron volando. No caus&amp;eacute; baja ni un d&amp;iacute;a en todo ese tiempo, as&amp;iacute; que seguro me trataron bien. Mis tareas all&amp;iacute; eran de lo m&amp;aacute;s variopintas, desde la &lt;strong&gt;creaci&amp;oacute;n de m&amp;uacute;ltiples p&amp;aacute;ginas web&lt;/strong&gt; (mi tarea principal), pasando por el control de los &lt;strong&gt;sistemas de computaci&amp;oacute;n&lt;/strong&gt; que se utilizan para c&amp;aacute;lculo, &lt;strong&gt;administraci&amp;oacute;n de servidores&lt;/strong&gt; o enredar con c&amp;aacute;maras y micr&amp;oacute;fonos para crear un sistema de &lt;strong&gt;grabaci&amp;oacute;n de seminarios&lt;/strong&gt;. Todo ello desde la libertad que nos dejaban para escoger soluciones y dentro de entornos de &lt;strong&gt;software libre&lt;/strong&gt; (&lt;a href="es.wikipedia.org/wiki/GNU/Linux"&gt;GNU/Linux&lt;/a&gt;).&lt;/p&gt;

&lt;p&gt;&lt;strong&gt;Aprend&amp;iacute; mucho&lt;/strong&gt;. Ahora veo que hubiese aprendido m&amp;aacute;s de algo concreto si hubiera entrado en otro tipo de empresa, pero nunca hubiese visto tantos sistemas y trabajado con Linux a diario como era mi intenci&amp;oacute;n. En programaci&amp;oacute;n me cost&amp;oacute; empezar a hacer las cosas medio bien, pues no tuve nadie que me ense&amp;ntilde;ase, hered&amp;eacute; c&amp;oacute;digo malo y malas formas de por s&amp;iacute;. Dejo atr&amp;aacute;s las rutinas adquiridas de mucho tiempo, &lt;strong&gt;la merienda y la comida ya no son a la misma hora siempre&lt;/strong&gt;, ni en el mismo sitio, ni con la misma gente.&lt;/p&gt;

&lt;p&gt;La gente es lo que m&amp;aacute;s echo de menos, he hecho grandes amigos y sigo en contacto con muchos, pero sin las conversaciones diarias se hace todo diferente. &lt;strong&gt;Hay muchos a los que me gustar&amp;iacute;a nombrar directamente&lt;/strong&gt; y no lo voy a hacer para no aburriros ni dejarme a nadie importante en el tintero. &lt;strong&gt;Mi &amp;uacute;ltimo&lt;/strong&gt; d&amp;iacute;a en la oficina&lt;strong&gt; fue triste&lt;/strong&gt;, con todo el mundo en casa de vacaciones por las fiestas me desped&amp;iacute; haciendo una foto a la puerta del laboratorio y recogiendo mis cosas m&amp;aacute;s solo que la una.&lt;/p&gt;

&lt;p&gt;&lt;img alt="" src="/media/portfolio/uploads/2014/12/27/lab1.jpg" style="height:383px; width:640px" /&gt;&lt;/p&gt;

&lt;p&gt;Lo que no me esperaba nunca, es que al volver de fiestas maquinasen todos contra m&amp;iacute;, para&lt;strong&gt; prepararme una cena de despedida y adem&amp;aacute;s sorpresa&lt;/strong&gt;. Les doy la raz&amp;oacute;n en que dejaron un mont&amp;oacute;n de pistas pero debo confesar que me la tragu&amp;eacute; entera y &lt;strong&gt;no la vi venir&lt;/strong&gt;.&lt;/p&gt;

&lt;p&gt;&lt;img alt="" src="/media/portfolio/uploads/2014/12/27/cena.jpg" style="height:383px; width:640px" /&gt;&lt;/p&gt;

&lt;p&gt;Se atrevieron a &lt;strong&gt;hacerme un regalo, una ecoesfera&lt;/strong&gt;, algo que vimos un d&amp;iacute;a en una web de gadgets frikis y que consiste en una bola de cristal totalmente cerrada, con un ecosistema entero dentro. Agua, aire, algas que transforman CO2 en ox&amp;iacute;geno mediante luz, bacterias que se alimentan de las algas y dos peque&amp;ntilde;os camarones que pululan comiendo bacterias. Presumo desde entonces de tener como mascotas a dos gambas y poco trabajo que me dan. Incluso parece ser que hasta &lt;strong&gt;est&amp;aacute;n criando&lt;/strong&gt; dentro de la esfera.&lt;/p&gt;

&lt;p&gt;&lt;img alt="" src="/media/portfolio/uploads/2014/12/27/bola.jpg" style="height:383px; width:640px" /&gt;&lt;/p&gt;

&lt;p&gt;Desde aqu&amp;iacute; les quiero dar las &lt;strong&gt;GRACIAS&lt;/strong&gt;&amp;nbsp;&lt;strong&gt;POR TODO&lt;/strong&gt; a toda la gente del IFISC por los buenos ratos que hemos pasado juntos, espero que os vaya bien a todos y que dentro de un tiempo pueda venir de visita para que compartamos los logros obtenidos. Para cualquier cosa creo que&amp;nbsp;&amp;nbsp;&lt;strong&gt;&lt;a href="http://eduherraiz.com/"&gt;ya&amp;nbsp;sab&amp;eacute;is&amp;nbsp;donde encontrarme&lt;/a&gt;&lt;/strong&gt;. Se que me vais a echar menos tambi&amp;eacute;n, sobretodo por las ensaimadas que os tra&amp;iacute;a de vez en cuando.&lt;/p&gt;

&lt;p&gt;&lt;img alt="" src="/media/portfolio/uploads/2014/12/27/ensaimada.jpg" style="height:383px; width:640px" /&gt;&lt;/p&gt;

</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Fri, 03 Feb 2012 08:00:24 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2012/02/03/despedida-del-ifisc/</guid><enclosure url="http://www.eduherraiz.com/media/portfolio/uploads/2014/12/27/lab1.jpg" length="100000" type="image/jpeg"></enclosure><category>Reflexiones</category></item><item><title>¿Sabiduría o inteligencia?
</title><link>http://www.eduherraiz.com/blog/2011/06/05/sabiduria-o-inteligencia/</link><description>&lt;p&gt;La sabidur&amp;iacute;a hace referencia a los conocimientos que ya se tienen, a las premisas que un aparato l&amp;oacute;gico como nuestro cerebro utiliza para sacar conclusiones. En cambio, la inteligencia es la capacidad de comprender o de adquirir nuevo conocimiento de una situaci&amp;oacute;n. Para adquirir conocimiento e incrementar la sabidur&amp;iacute;a no necesariamente se ha tenido que aplicar la inteligencia. Podemos leer un postulado,&amp;nbsp; comprender el camino l&amp;oacute;gico que lleva hasta ah&amp;iacute; y asimilar ese conocimiento como certero.&amp;nbsp; La persona inteligente es la que lo descubri&amp;oacute; sin ayuda. Por ejemplo, yo entiendo en alguna medida la teor&amp;iacute;a de la relatividad, pero no tengo la inteligencia para deducirla como hizo Einstein. Ante la disyuntiva del titular&amp;nbsp; es dif&amp;iacute;cil para m&amp;iacute; escoger que es lo que tiene m&amp;aacute;s valor. Socialmente se da m&amp;aacute;s valor a la inteligencia. Eso lo aprend&amp;iacute; de muy peque&amp;ntilde;o, estando en el colegio. No recuerdo la edad exacta, pero con menos de 9 a&amp;ntilde;os. Un d&amp;iacute;a el profesor puso la siguiente frase en la pizarra: &amp;quot;&lt;em&gt;d&amp;aacute;bale arroz a la zorra el abad&lt;/em&gt;&amp;quot;; dici&amp;eacute;ndonos a los alumnos que si alguno sab&amp;iacute;a que ten&amp;iacute;a de especial esa frase, se levantase y fuese a dec&amp;iacute;rselo al o&amp;iacute;do. Yo me percat&amp;eacute; en ese momento de la cualidad de &lt;a href="http://buscon.rae.es/draeI/SrvltGUIBusUsual?LEMA=pal%C3%ADndromo&amp;amp;origen=RAE"&gt;pal&amp;iacute;ndromo&lt;/a&gt; de la oraci&amp;oacute;n aplicando mi inteligencia. As&amp;iacute; fui a dec&amp;iacute;rselo al profesor junto a otros dos alumnos m&amp;aacute;s. El profesor nos felicit&amp;oacute; por haber acertado todos y resolvi&amp;oacute; el misterio para el resto de la clase, pero luego vino el momento interesante: nos pregunt&amp;oacute; a los tres alumnos si ya lo sab&amp;iacute;amos o si lo hab&amp;iacute;amos deducido al momento de ver la frase. Yo contest&amp;eacute; primero, mintiendo, diciendo que ya lo sab&amp;iacute;a de antes, confiado en que la sabidur&amp;iacute;a era mucho m&amp;aacute;s valiosa que la inteligencia, en cambio, los otros dos contestaron lo contrario. Para mi sorpresa, el profesor engrandeci&amp;oacute; el logro de mis dos compa&amp;ntilde;eros despreciando mi supuesta sabidur&amp;iacute;a declarada. Desde ese d&amp;iacute;a, tengo la mala costumbre de&amp;nbsp; hacer ver, en los hechos que as&amp;iacute; lo permiten, que resolv&amp;iacute; el problema con&amp;nbsp; mi inteligencia no con mi sabidur&amp;iacute;a, aunque no fuese el caso. Ahora veo que es ultracomplicado conseguir un alto grado de sabidur&amp;iacute;a, que alguno no naci&amp;oacute; con el don de la inteligencia, pero a base de constancia y buen trabajo puede dar lecciones a m&amp;aacute;s de un inteligente. Y creo que esto se debe valorar, hasta incluso m&amp;aacute;s, que la propia inteligencia.&lt;/p&gt;

</description><author>gshark@gmail.com (Edu Herraiz)</author><pubDate>Sun, 05 Jun 2011 11:00:10 +0000</pubDate><guid>http://www.eduherraiz.com/blog/2011/06/05/sabiduria-o-inteligencia/</guid><category>Reflexiones</category></item></channel></rss>